import React from 'react'
import './Tales.css'
import s from './s.mp3'
import d from './das.jpg'
import { BsDoorOpenFill } from 'react-icons/bs'
import { Link } from 'react-router-dom'

const Tales = () => {
    return (
        <div className='tales'>
            <div className="tales__container">
                <div className="tales__body">
                    <div className="tales__circle"></div>
                    <div className="tales__content-section">
                        <div className="tales__title">
                            <Link to='/' className="leave">
                                <BsDoorOpenFill />
                            </Link>
                            <h1>Жомоктор</h1>
                        </div>
                        <div className="tales__cards">
                        <div>
        <img className='imgkutman' src={d} alt="" />
      </div>
    <div className='kutman'>
      <h1>чабалакей менен Жылан</h1>
      <h2>
    Эки чабалекей келди. Уя жасай башташты. Балчыкты күнгө кылга аралаштырышты. Биринин үстүнө экинчисин кичинеден алып келип жатышты. Бир нече күндөн кийин чөйчөктөй болгон уя даяр болду. Уянын сырты быдырала ылайга аралаштырган жүн, кылдар самсаалап чыгып турду. Чабалакейдин бири күн түн дебей уясында жатты. Экинчиси ага тамак ташып келет. Бир нече күндөн кийин беш балапан чыгарды. Балапандар энеси жем алып келгенде жандары калышчу эмес. Баары тең оозун ачып ага умтулчу. Бир күнү түш мезгили чабалакей балапандарына жем берип болду. Уясында эс алып жаткан. Бир убакта устундун түбүндө жаткан жыланды көрүп коркуп кетти. — Ой сен ким болосуң ? Аты жөнүндү айтчы. — Аа менин ким экенимди тааныбайсыңбы ? — Кана өзүң айтчы ким болмок элең жылансың. — Мына айтпадымбы бийик тургандыктан тааныбай атасың. Бери түшүп келсең сүйлөшөлү — деп жылан тилин соймоңдотуп башын көтөрдү. — Ии тигини мени алдап жатканын көр. Сен жылансың жаныңа барсам чагып аласың, жыландан корком — деди чабалакей. — Жыландан мен да корком анын тили узун, тилинин учунда уусу болот. — Менин тишим абдан майда. Тилим гана узун — деп тилин соймоңдотуп койду. — Жылан болбосоң анан эмнесиң ?- деди чабалакейтаң калып. — Мен кескелдирик болом. — Кескелдириктин буттары болчу эле сенин буттарың кана ? -деди чабалакей. — Сен кескелдириктин көбүн көргөн эмес турбайсыңбың. Кээбир кескелдириктерде бут жок болот — деди жылан. Жок мен ишенбейм сен жылан элесиң — деди чабалакей. Мага ишенбейт экенсиң го эмесе жаныңа барып ишендирейин. Жылан устунга оролуп жогору сойлой баштады. Чабалакей балдарымды жылан жейт экен деп коркту. Уясынан учуп тышка чыкты, кайра уясына келди. Балдарынын оозун ачып жем сураганын көрдү. Шордуу балдарым ай оозуңарды ачып, жем сурайсыңар. Өзүңөр бирөөгө жем болгону жатканыңарды билбейсиңер. Байкуштарым ай деп чабалакей чырылдап жиберди. Жылан сойлоп чыгып келе жатты. Чабалакей чырылдап тышка учуп чыкты. Кайр учуп келип балдаврын көрмөкчү болду. Чырылдап учуп канаты менен жыланды чаап өттү. Жылан тоготуп койгон жок. Үйдүн жанындагы жол менен өгүз минген абышка тоодон келе жаткан. Ал үйдүн жанына келди. Тамга кирип чыгып чырылдап жүргөн чабалакейди көрүп таң калды. Тамдын эки жагын карап туруп ичине кирди. Чабалакейдин уясына жаңы башын салып бара жаткан жыланды көрдү. Колундагы ыргай сабоосу менен жыланды бел талаштыра чаап-чаап жиберди. Жылан тоголотошуп жерге түштү. Бирөөгө зордук кылам деген жылан өлүмгө дуушар болду. Чабалакей балдарынын аман калганына кубанды. Абышкага алкыш айтты.
    </h2>
  </div>
  <div> 
 <audio controls className='dadmom'>
  <source src={s} type='audio/mpeg'/>
 </audio>
  </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    )
}

export default Tales